app/views/admin/shops/new.html.erb

SELECT "genres".* FROM "genres"
SELECT "categories".* FROM "categories"
---
<h1>画像投稿フォーム</h1>
<%= form_with model: @shop, local:true do |f| %>
  <h4>画像</h4>
  <%= f.attachment_field :image %>
  <h4>アイテム</h4>
  <%= f.text_field :item %>
  <h4>説明</h4>
  <%= f.text_area :body %>
  <h4>genre</h4>
    <!--%= f.select :genre,  [["cake","cake"], ["pudding","pudding"], ["bake","bake"], ["candy","candy"]]) %>-->
    <!--%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) do |category| %>-->