app/views/shops/index.html.erb

  <div class="row my-4">
    <h1>商品一覧</h1><h4 class="pt-3">（全<%= Shop.ids.count %>件）</h2>
---
SELECT "shops"."id" FROM "shops"