app/controllers/admin/shops_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @shop = Shop.new
    @genres = Genre.all

INSERT INTO "shops" ("image_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image_id", "ddbc5a2fd0cb7e168663a5980ad3541de8cc5f3dac08b2243c36e298e558"], ["price", "111"], ["created_at", "2021-05-10 21:50:19.913085"], ["updated_at", "2021-05-10 21:50:19.913085"]]
---
  def create
    @shop = Shop.new(shop_params)
    # @shop.user_id = current_user.id
    @shop.save