app/controllers/homes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "1"], ["LIMIT", 1]]
---
  def mypage
    @user = User.find_by(name: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "1"], ["LIMIT", 1]]
---
  def unsubscribe
    @user = User.find_by(name: params[:name])