app/controllers/shops_controller.rb

  def create
    @shop = Shop.new(shop_params)
    @shop.save
---
INSERT INTO "shops" ("item", "body", "image_id", "price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def index
    @shops = Shop.all
---
SELECT "shops"."id" FROM "shops"

  def show
     @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @shop = Shop.find(params[:id])
    @shop.destroy
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 1]]