app/controllers/users/cart_items_controller.rb

INSERT INTO "cart_items" ("user_id", "shop_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["shop_id", 1], ["amount", 1], ["created_at", "2021-05-11 00:26:11.649474"], ["updated_at", "2021-05-11 00:26:11.649474"]]
---
    def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.user_id = current_user.id
    @cart_item.save!

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-05-11 00:32:20.187577"], ["id", 1]]
---
    def update
        @cart_item = CartItem.find(params[:id])
        @cart_item.update(cart_item_params)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
    def destroy
     @cart_item = CartItem.find(params[:id])
     @cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
    def destroy_all
     @cart_item = current_user.cart_items
     @cart_item.destroy_all