app/controllers/users/sessions_controller.rb

  def reject_inactive_user
    @user = User.find_by(name: params[:user][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT ?  [["LIMIT", 1]]